In [2]:
import pandas as pd
from sqlalchemy import create_engine, text
engine = create_engine("mysql+mysqlconnector://root:abc@127.0.0.1:3306/cs544")
conn = engine.connect()

# https://github.com/cfpb/api/tree/master/resources/datasets/hmda/code_sheets
loan_cols = ["lei", "action_taken", "loan_type", "loan_amount", "interest_rate", "loan_purpose", "income"]

In [5]:
list(conn.execute(text("select * from accounts")))

[(1, 'A', 10), (1, 'B', 100)]

In [6]:
pd.read_sql(text("select * from accounts"), conn)

   user_id name  amount
0        1    A      10
1        1    B     100

In [10]:
df = pd.read_csv("https://raw.githubusercontent.com/cfpb/api/master/resources/datasets/hmda/code_sheets/action_taken.csv")
df.to_sql("actions", conn, index=False, if_exists="replace")

8

In [11]:
df = pd.read_csv("https://raw.githubusercontent.com/cfpb/api/master/resources/datasets/hmda/code_sheets/loan_type.csv")
df.to_sql("loan_type", conn, index=False, if_exists="replace")

4

In [12]:
df = pd.read_csv("https://raw.githubusercontent.com/cfpb/api/master/resources/datasets/hmda/code_sheets/loan_purpose.csv")
df.to_sql("purposes", conn, index=False, if_exists="replace")

3

In [13]:
pd.read_sql(text("select * from purposes"), conn)

   id      loan_purpose
0   1     Home purchase
1   2  Home improvement
2   3       Refinancing

In [14]:
df = pd.read_parquet("loans.parquet", columns=loan_cols)
df.head()

,lei,action_taken,loan_type,loan_amount,interest_rate,loan_purpose,income
0,54930034MNPILHP25H80,6,1,305000.0,3.875,1,108.0
1,54930034MNPILHP25H80,4,1,65000.0,None,1,103.0
2,54930034MNPILHP25H80,6,1,75000.0,3.25,1,146.0
3,54930034MNPILHP25H80,1,1,155000.0,4.0,32,70.0
4,54930034MNPILHP25H80,1,1,305000.0,3.25,1,71.0

In [15]:
len(df)

447367

In [16]:
df.to_sql("loans", conn, chunksize=1000, index=False, if_exists="replace")

447367

In [17]:
conn.commit()

In [23]:

conn.execute(text("""
update accounts set amount = amount - 6
WHERE name = 'A'
"""))

In [24]:
conn.execute(text("""
update accounts set amount = amount + 6
WHERE name = 'B'
"""))

In [25]:
rows = list(conn.execute(text("select amount from accounts where name='A'")))
if rows[0][0] >= 0:
    conn.commit()
    print("transaction complete")
else:
    conn.rollback()
    print("transaction failed")

transaction failed

# Query Practice

In [28]:
# what are the first 10 loans?  Practice LIMIT.
pd.read_sql(text("""
SELECT *
FROM loans
LIMIT 10;
"""), conn)

,lei,action_taken,loan_type,loan_amount,interest_rate,loan_purpose,income
0,54930034MNPILHP25H80,6,1,305000.0,3.875,1,108.0
1,54930034MNPILHP25H80,4,1,65000.0,None,1,103.0
2,54930034MNPILHP25H80,6,1,75000.0,3.25,1,146.0
3,54930034MNPILHP25H80,1,1,155000.0,4.0,32,70.0
4,54930034MNPILHP25H80,1,1,305000.0,3.25,1,71.0
5,54930034MNPILHP25H80,1,1,175000.0,3.375,1,117.0
6,54930034MNPILHP25H80,1,1,575000.0,4.5,1,180.0
7,54930034MNPILHP25H80,1,1,105000.0,5.375,1,180.0
8,54930034MNPILHP25H80,1,1,85000.0,3.375,1,136.0
9,549300FQ2SN6TRRGB032,1,1,405000.0,Exempt,1,NaN

In [ ]:
# projection: choosing what columns (SELECT)

In [ ]:
# selection: filtering rows (WHERE)

In [30]:
# what are the first 10 interest rates and loan amounts (in thousands)?  Practice SELECT.
pd.read_sql(text("""
SELECT interest_rate, (loan_amount / 1000) AS loan_thousands
FROM loans
LIMIT 10;
"""), conn)

  interest_rate  loan_thousands
0         3.875           305.0
1          None            65.0
2          3.25            75.0
3           4.0           155.0
4          3.25           305.0
5         3.375           175.0
6           4.5           575.0
7         5.375           105.0
8         3.375            85.0
9        Exempt           405.0

In [31]:
# what are the loans for individuals with income over $1 million?  Practice WHERE.
pd.read_sql(text("""
SELECT *
FROM loans
WHERE income >= 1000000
"""), conn)

,lei,action_taken,loan_type,loan_amount,interest_rate,loan_purpose,income
0,254900IER2H3R8YLBW04,1,1,105000.0,2.875,31,1530000.0
1,3Y4U8VZURTYWI1W2K376,3,1,7455000.0,None,4,94657029.0
2,549300CS1XP28EERR469,1,1,75000.0,4.99,4,2030000.0
3,549300CS1XP28EERR469,1,1,205000.0,3.75,1,7291000.0

In [26]:
# what are the five biggest loans in terms of dollar amount?  Practice ORDER BY.
# what are the actions taken and types for those loans (show the text, not numbers)?  Practice INNER JOIN.
# what is a loan_purpose that doesn't appear in the loans table?  Practice LEFT/RIGHT JOIN.
# how many rows are in the table?  Practice COUNT(*).
# how many non-null values are in the income column?  Practice COUNT(column).
# what is the average interest rate for loans of type "Conventional"?  Practice AVG.
# how many loans are there of each type?  Practice GROUP BY.
# which loan types appear at least 10,000 times?  Practice HAVING.
# how many loans are between $10K and 20K?  Practice BETWEEN.
# how fast is the above query with and without a BTREE index?  Practice indexing.
# how many loans are there of each type?
# which loan types appear at least 10,000 times?
# how many loans are between $10K and 20K?
# how fast is the above query with and without a BTREE index?